Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70N20B.PIC
      <edc:SFRDef edc:_addr="0x40038144" edc:access="-rrrrrrrrrrr-rrrrrrr--rrrrrrrrrr" edc:cname="USBHS_DEVEPTISR5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINI" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPI" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTI" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINI" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDI" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequence" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Number of Busy Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:desc="Read/Write Allowed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:desc="Control Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration OK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:desc="Byte Count" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038148" edc:access="-rrrrrrrrrrr-rrrrrrr--rrrrrrrrrr" edc:cname="USBHS_DEVEPTISR6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINI" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPI" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTI" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINI" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDI" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequence" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Number of Busy Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:desc="Read/Write Allowed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:desc="Control Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration OK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:desc="Byte Count" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003814C" edc:access="-rrrrrrrrrrr-rrrrrrr--rrrrrrrrrr" edc:cname="USBHS_DEVEPTISR7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINI" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPI" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTI" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINI" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDI" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequence" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Number of Busy Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:desc="Read/Write Allowed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:desc="Control Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration OK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:desc="Byte Count" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038150" edc:access="-rrrrrrrrrrr-rrrrrrr--rrrrrrrrrr" edc:cname="USBHS_DEVEPTISR8" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINI" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPI" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTI" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINI" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDI" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequence" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Number of Busy Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:desc="Read/Write Allowed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:desc="Control Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration OK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:desc="Byte Count" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
